contiki-os/contiki/cpu/cc253x/cc253x.h
/* ADC */
SFR(ADCCON1,   0xB4); /* ADC control 1 */
SFR(ADCCON2,   0xB5); /* ADC control 2 */
SFR(ADCCON3,   0xB6); /* ADC control 3 */
SFR(ADCL,      0xBA); /* ADC data low */
SFR(ADCH,      0xBB); /* ADC data high */
SFR(RNDL,      0xBC); /* Random number generator data low */
SFR(RNDH,      0xBD); /* Random number generator data high */

/* AES Coprocessor */
SFR(ENCDI,     0xB1); /* Encryption/decryption input data */
SFR(ENCDO,     0xB2); /* Encryption/decryption output data */
SFR(ENCCS,     0xB3); /* Encryption/decryption control and status */

/* DMA Controller */
SFR(DMAIRQ,    0xD1); /* DMA interrupt flag */
SFR(DMA1CFGL,  0xD2); /* DMA channel 1–4 configuration address low */
SFR(DMA1CFGH,  0xD3); /* DMA channel 1–4 configuration address high */
SFR(DMA0CFGL,  0xD4); /* DMA channel 0 configuration address low */
SFR(DMA0CFGH,  0xD5); /* DMA channel 0 configuration address high */
SFR(DMAARM,    0xD6); /* DMA channel armed */
SFR(DMAREQ,    0xD7); /* DMA channel start request and status */

/* I/O */
SFR(P0IFG,     0x89); /* Port 0 interrupt status flag */
SFR(P1IFG,     0x8A); /* Port 1 interrupt status flag */
SFR(P2IFG,     0x8B); /* Port 2 interrupt status flag */
SFR(PICTL,     0x8C); /* Port pins interrupt mask and edge */
SFR(P0IEN,     0xAB); /* Port 0 interrupt mask */
SFR(P1IEN,     0x8D); /* Port 1 interrupt mask */
SFR(P2IEN,     0xAC); /* Port 2 interrupt mask */
SFR(P0INP,     0x8F); /* Port 0 input Mode */
SFR(PERCFG,    0xF1); /* Peripheral I/O control */
SFR(APCFG,     0xF2); /* Analog peripheral I/O configuration */
SFR(P0SEL,     0xF3); /* Port 0 function select */
SFR(P1SEL,     0xF4); /* Port 1 function select */
SFR(P2SEL,     0xF5); /* Port 2 function select */
SFR(P1INP,     0xF6); /* Port 1 input mode */
SFR(P2INP,     0xF7); /* Port 2 input mode */
SFR(P0DIR,     0xFD); /* Port 0 direction */
SFR(P1DIR,     0xFE); /* Port 1 direction */
SFR(P2DIR,     0xFF); /* Port 2 direction */
SFR(PMUX,      0xAE); /* Power-down signal mux */

/* Memory */
SFR(MPAGE,     0x93); /* Memory page select */
SFR(_XPAGE,    0x93); /* Memory page select - SDCC name */
SFR(MEMCTR,    0xC7); /* Memory system control */
SFR(FMAP,      0x9F); /* Flash-memory bank mapping */
SFR(PSBANK,    0x9F); /* Flash-memory bank mapping - SDCC name */

/* RF */
SFR(RFIRQF1,   0x91); /* RF interrupt flags MSB */
SFR(RFD,       0xD9); /* RF data */
SFR(RFST,      0xE1); /* RF command strobe */
SFR(RFIRQF0,   0xE9); /* RF interrupt flags LSB */
SFR(RFERRF,    0xBF); /* RF error interrupt flags */

/* Sleep Timer */
SFR(ST0,       0x95); /* Sleep Timer 0 */
SFR(ST1,       0x96); /* Sleep Timer 1 */
SFR(ST2,       0x97); /* Sleep Timer 2 */
SFR(STLOAD,    0xAD); /* Sleep-timer load status */
SFR(SLEEPCMD,  0xBE); /* Sleep-mode control command */
SFR(SLEEPSTA,  0x9D); /* Sleep-mode control status */

/* Power Management and Clocks */
SFR(CLKCONCMD, 0xC6); /* Clock control command */
SFR(CLKCONSTA, 0x9E); /* Clock control status */

/* Timer 1 */
SFR(T1CC0L,    0xDA); /* Timer 1 channel 0 capture/compare value low */
SFR(T1CC0H,    0xDB); /* Timer 1 channel 0 capture/compare value high */
SFR(T1CC1L,    0xDC); /* Timer 1 channel 1 capture/compare value low */
SFR(T1CC1H,    0xDD); /* Timer 1 channel 1 capture/compare value high */
SFR(T1CC2L,    0xDE); /* Timer 1 channel 2 capture/compare value low */
SFR(T1CC2H,    0xDF); /* Timer 1 channel 2 capture/compare value high */
SFR(T1CNTL,    0xE2); /* Timer 1 counter low */
SFR(T1CNTH,    0xE3); /* Timer 1 counter high */
SFR(T1CTL,     0xE4); /* Timer 1 control and status */
SFR(T1CCTL0,   0xE5); /* Timer 1 channel 0 capture/compare control */
SFR(T1CCTL1,   0xE6); /* Timer 1 channel 1 capture/compare control */
SFR(T1CCTL2,   0xE7); /* Timer 1 channel 2 capture/compare control */
SFR(T1STAT,    0xAF); /* Timer 1 status */

/* Timer 2 (MAC Timer) */
SFR(T2CTRL,    0x94); /* Timer 2 control */
SFR(T2EVTCFG,  0x9C); /* Timer 2 event configuration */
SFR(T2IRQF,    0xA1); /* Timer 2 interrupt flags */
SFR(T2M0,      0xA2); /* Timer 2 multiplexed register 0 */
SFR(T2M1,      0xA3); /* Timer 2 multiplexed register 1 */
SFR(T2MOVF0,   0xA4); /* Timer 2 multiplexed overflow register 0 */
SFR(T2MOVF1,   0xA5); /* Timer 2 multiplexed overflow register 1 */
SFR(T2MOVF2,   0xA6); /* Timer 2 multiplexed overflow register 2 */
SFR(T2IRQM,    0xA7); /* Timer 2 interrupt mask */
SFR(T2MSEL,    0xC3); /* Timer 2 multiplex select */

/* Timer 3 */
SFR(T3CNT,     0xCA); /* Timer 3 counter */
SFR(T3CTL,     0xCB); /* Timer 3 control */
SFR(T3CCTL0,   0xCC); /* Timer 3 channel 0 compare control */
SFR(T3CC0,     0xCD); /* Timer 3 channel 0 compare value */
SFR(T3CCTL1,   0xCE); /* Timer 3 channel 1 compare control */
SFR(T3CC1,     0xCF); /* Timer 3 channel 1 compare value */

/* Timer 4 */
SFR(T4CNT,     0xEA); /* Timer 4 counter */
SFR(T4CTL,     0xEB); /* Timer 4 control */
SFR(T4CCTL0,   0xEC); /* Timer 4 channel 0 compare control */
SFR(T4CC0,     0xED); /* Timer 4 channel 0 compare value */
SFR(T4CCTL1,   0xEE); /* Timer 4 channel 1 compare control */
SFR(T4CC1,     0xEF); /* Timer 4 channel 1 compare value */

/* Timer 1, 3, 4 join Interrupts */
SFR(TIMIF,     0xD8); /* Timers 1/3/4 joint interrupt mask/flags */
  SBIT(OVFIM,    0xD8, 6); /* Timer 1 overflow interrupt mask */
  SBIT(T4CH1IF,  0xD8, 5); /* Timer 4 channel 1 interrupt flag */
  SBIT(T4CH0IF,  0xD8, 4); /* Timer 4 channel 0 interrupt flag */
  SBIT(T4OVFIF,  0xD8, 3); /* Timer 4 overflow interrupt flag */
  SBIT(T3CH1IF,  0xD8, 2); /* Timer 3 channel 1 interrupt flag */
  SBIT(T3CH0IF,  0xD8, 1); /* Timer 3 channel 0 interrupt flag */
  SBIT(T3OVFIF,  0xD8, 0); /* Timer 3 overflow interrupt flag */

/* USART 0 */
SFR(U0CSR,     0x86); /* USART 0 control and status */
SFR(U0DBUF,    0xC1); /* USART 0 receive/transmit data buffer */
SFR(U0BAUD,    0xC2); /* USART 0 baud-rate control */
SFR(U0UCR,     0xC4); /* USART 0 UART control */
SFR(U0GCR,     0xC5); /* USART 0 generic control */

/* USART 1 */
SFR(U1CSR,     0xF8); /* USART 1 control and status */
  SBIT(MODE,     0xF8, 7); /* USART mode select */
  SBIT(RE,       0xF8, 6); /* UART receiver enable */
  SBIT(SLAVE,    0xF8, 5); /* SPI master- or slave mode select */
  SBIT(FE,       0xF8, 4); /* UART framing error status */
  SBIT(ERR,      0xF8, 3); /* UART parity error status */
  SBIT(RX_BYTE,  0xF8, 2); /* Receive byte status */
  SBIT(TX_BYTE,  0xF8, 1); /* Transmit byte status */
  SBIT(ACTIVE,   0xF8, 0); /* USART transmit/receive active status */
SFR(U1DBUF,    0xF9); /* USART 1 receive/transmit data buffer */
SFR(U1BAUD,    0xFA); /* USART 1 baud-rate control */
SFR(U1UCR,     0xFB); /* USART 1 UART control */
SFR(U1GCR,     0xFC); /* USART 1 Generic control */

/* Watchdog Timer */
SFR(WDCTL,     0xC9); /* Watchdog Timer Control */
/*---------------------------------------------------------------------------
 * XREG Registers (0x6000–0x63FF), excluding RF and USB registers
 * (Table 2.2, page 31)
 *---------------------------------------------------------------------------*/
SFRX(MONMUX ,    0x61A6); /* Operational amplifier mode control (cc2530/31) */
SFRX(OPAMPMC,    0x61A6); /* Battery monitor MUX (cc2533) */
/* I2C registers - cc2533 only */
SFRX(I2CCFG,     0x6230); /* I2C control */
SFRX(I2CSTAT,    0x6231); /* I2C status */
SFRX(I2CDATA,    0x6232); /* I2C data */
SFRX(I2CADDR,    0x6233); /* I2C own slave address */
SFRX(I2CWC,      0x6234); /* Wrapper Control */
SFRX(I2CIO,      0x6235); /* GPIO */
/* End I2C registers */
SFRX(OBSSEL0,    0x6243); /* Observation output control - register 0 */
SFRX(OBSSEL1,    0x6244); /* Observation output control - register 1 */
SFRX(OBSSEL2,    0x6245); /* Observation output control - register 2 */
SFRX(OBSSEL3,    0x6246); /* Observation output control - register 3 */
SFRX(OBSSEL4,    0x6247); /* Observation output control - register 4 */
SFRX(OBSSEL5,    0x6248); /* Observation output control - register 5 */
SFRX(CHVER,      0x6249); /* Chip version */
SFRX(CHIPID,     0x624A); /* Chip identification */
SFRX(TR0,        0x624B); /* Test register 0 */
SFRX(DBGDATA,    0x6260); /* Debug interface write data */
SFRX(SRCRC,      0x6262); /* Sleep reset CRC */
SFRX(BATTMON,    0x6264); /* Battery monitor */
SFRX(IVCTRL,     0x6265); /* Analog control register */
SFRX(FCTL,       0x6270); /* Flash control */
SFRX(FADDRL,     0x6271); /* Flash address low */
SFRX(FADDRH,     0x6272); /* Flash address high */
SFRX(FWDATA,     0x6273); /* Flash write data */
SFRX(CHIPINFO0,  0x6276); /* Chip information byte 0 */
SFRX(CHIPINFO1,  0x6277); /* Chip information byte 1 */
SFRX(IRCTL,      0x6281); /* Timer 1 IR generation control */
SFRX(CLD,        0x6290); /* Clock-loss detection */
SFRX(XX_T1CCTL0, 0x62A0); /* Timer 1 channel 0 capture/compare control (additional XREG mapping of SFR) */
SFRX(XX_T1CCTL1, 0x62A1); /* Timer 1 channel 1 capture/compare control (additional XREG mapping of SFR register) */
SFRX(XX_T1CCTL2, 0x62A2); /* Timer 1 channel 2 capture/compare control (additional XREG mapping of SFR register) */
SFRX(T1CCTL3,    0x62A3); /* Timer 1 channel 3 capture/compare control */
SFRX(T1CCTL4,    0x62A4); /* Timer 1 channel 4 capture/compare control */
SFRX(XX_T1CC0L,  0x62A6); /* Timer 1 channel 0 capture/compare value low (additional XREG mapping of SFR register) */
SFRX(XX_T1CC0H,  0x62A7); /* Timer 1 channel 0 capture/compare value high (additional XREG mapping of SFR register) */
SFRX(XX_T1CC1L,  0x62A8); /* Timer 1 channel 1 capture/compare value low (additional XREG mapping of SFR register) */
SFRX(XX_T1CC1H,  0x62A9); /* Timer 1 channel 1 capture/compare value high (additional XREG mapping of SFR register) */
SFRX(XX_T1CC2L,  0x62AA); /* Timer 1 channel 2 capture/compare value low (additional XREG mapping of SFR register) */
SFRX(XX_T1CC2H,  0x62AB); /* Timer 1 channel 2 capture/compare value high (additional XREG mapping of SFR register) */
SFRX(T1CC3L,     0x62AC); /* Timer 1 channel 3 capture/compare value low */
SFRX(T1CC3H,     0x62AD); /* Timer 1 channel 3 capture/compare value high */
SFRX(T1CC4L,     0x62AE); /* Timer 1 channel 4 capture/compare value low */
SFRX(T1CC4H,     0x62AF); /* Timer 1 channel 4 capture/compare value high */
SFRX(STCC,       0x62B0); /* Sleep Timer capture control */
SFRX(STCS,       0x62B1); /* Sleep Timer capture status */
SFRX(STCV0,      0x62B2); /* Sleep Timer capture value byte 0 */
SFRX(STCV1,      0x62B3); /* Sleep Timer capture value byte 1 */
SFRX(STCV2,      0x62B4); /* Sleep Timer capture value byte 2 */
SFRX(OPAMPC,     0x62C0); /* Operational amplifier control */
SFRX(OPAMPS,     0x62C1); /* Operational amplifier status */
SFRX(CMPCTL,     0x62D0); /* Analog comparator control and status */
/*---------------------------------------------------------------------------
 * Radio Registers
 * (Sec. 23, page 211)
 *---------------------------------------------------------------------------*/
SFRX(RFCORE_RAM,      0x6000); /* RF Core Memory Map (0x6000 to 0x0617F) */
SFRX(RXFIFO,          0x6000); /* TXFIFO Direct Access (0x6000 to 0x607F) */
SFRX(TXFIFO,          0x6080); /* TXFIFO Direct Access (0x6080 to 0x60FF) */

